driver-tests/bpelse/xslt/DoXslTransformJBI/test/outputToDoMarshal/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:outputString xmlns:msgns="http://j2ee.netbeans.org/wsdl/SimpleTransformationService" xmlns:ns1="http://xml.netbeans.org/schema/SimpleTransformation">&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;sports&gt;&lt;cricket id="243"&gt;&lt;comment&gt;More popular among commonwealth nations.&lt;/comment&gt;&lt;/cricket&gt;&lt;baseball id="243"&gt;&lt;comment&gt;More popular among commonwealth nations.&lt;/comment&gt;&lt;/baseball&gt;&lt;soccer id="243"&gt;&lt;comment&gt;More popular among commonwealth nations.&lt;/comment&gt;&lt;/soccer&gt;&lt;/sports&gt;</ns1:outputString>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
