driver-tests/bpelse/xslt/DoXslTransformJBI/test/outputToDoMarshal/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sim="http://xml.netbeans.org/schema/SimpleTransformation">
  <soapenv:Body>
    <sim:sports>
      <!--1 or more repetitions:-->
      <sim:game title="cricket">
        <sim:id>243</sim:id>
        <sim:para>More popular among commonwealth nations.</sim:para>
      </sim:game>
      <sim:game title="baseball">
        <sim:id>431</sim:id>
        <sim:para>More popular in America.</sim:para>
      </sim:game>
      <sim:game title="soccer">
        <sim:id>123</sim:id>
        <sim:para>Most popular sport in the world.</sim:para>
      </sim:game>
    </sim:sports>
  </soapenv:Body>
</soapenv:Envelope>